[
  {
    "slug": "race-tier-list",
    "title": "Race Tier List - Best Races in The Forge",
    "description": "Complete tier list ranking all races from S to C tier with detailed analysis. Learn which races are best for PVP, mining, and forging in The Forge Roblox.",
    "category": "Races",
    "author": "The Forge Wiki Team",
    "difficulty": "Beginner",
    "lastUpdated": "2024-03-15",
    "content": [
      {
        "section": "Introduction to Races",
        "text": "In The Forge Roblox, your race determines your character's abilities, stats, and playstyle. Races range from Common to Mythical rarity, with Mythical races having only a 0.5% drop rate when rerolling at the Wizard NPC in Stonewake's Cross."
      },
      {
        "section": "S-Tier Races",
        "text": "The S-tier races are the most powerful in The Forge. Demon (Mythical) offers incredible damage output and is perfect for end-game content. These races excel in both PVP and PVE scenarios, making them highly sought after by competitive players."
      },
      {
        "section": "A-Tier Races",
        "text": "A-tier races like Shadow provide excellent abilities such as dodge chance, making them the PVP meta choice. These races offer great balance between offense and defense, suitable for most playstyles."
      },
      {
        "section": "B-Tier and C-Tier Races",
        "text": "Lower tier races are still viable for beginners and casual players. While they may not have the raw power of S-tier races, they often have unique abilities that can be useful in specific situations or for learning the game mechanics."
      },
      {
        "section": "How to Reroll Your Race",
        "text": "Visit the Wizard NPC at Stonewake's Cross to reroll your race. You can use codes or in-game currency to reroll. Remember that Mythical races are extremely rare (0.5% chance), so be prepared for multiple rerolls if you're aiming for a specific Mythical race."
      }
    ],
    "tags": ["races", "tier-list", "reroll", "beginner", "stats"]
  },
  {
    "slug": "advanced-strategies",
    "title": "Advanced Strategies for The Forge",
    "category": "Advanced",
    "difficulty": "Expert",
    "author": "Pro Player",
    "lastUpdated": "2024-03-20",
    "description": "Master-level strategies for experienced players. Learn optimal mining routes, forging techniques, and quest completion strategies to maximize efficiency in The Forge Roblox.",
    "content": [
      {
        "section": "Optimal Mining Strategy",
        "text": "To maximize ore gathering in The Forge, focus on getting the Arcane Pickaxe first by completing Bard's Lost Guitar quest. The Arcane Pickaxe provides +200% mining speed, making it essential for efficient resource gathering. Plan your mining depth based on the ores you need for your current crafting goals."
      },
      {
        "section": "Forging Mastery",
        "text": "Master the 3-step manual forging minigame to consistently create high-quality items. Normal quality is the baseline, but aiming for Masterwork quality significantly increases item stats. Practice the timing and pattern recognition to achieve consistent Masterwork results for your most important gear."
      },
      {
        "section": "Quest Prioritization",
        "text": "Prioritize Bard's Lost Guitar quest early to unlock the Arcane Pickaxe. This tool accelerates all subsequent mining activities. Complete the Goblin King quest only after accumulating sufficient resources for all five escalating tributes. Save rare gems like Rubies for the final tribute."
      },
      {
        "section": "Resource Management",
        "text": "Don't waste rare ores on low-tier crafting. Save Mithril, Demonite, and Adamantite for end-game equipment. Use common ores (Iron, Copper, Silver) for practice and basic gear. Always maintain a stockpile of Gold for quest tributes and essential upgrades."
      },
      {
        "section": "Race Selection Strategy",
        "text": "Choose your race based on your playstyle. For PVP-focused players, Shadow (A-tier) with dodge chance is the meta. For end-game content, Demon (S-tier Mythical) provides unmatched damage. Use race reroll codes from the wiki to maximize your chances of getting your desired race."
      }
    ],
    "tags": ["advanced", "strategy", "mining", "forging", "expert", "optimization"]
  },
  {
    "slug": "item-location-guide",
    "title": "Complete Item Location Guide - The Forge",
    "category": "Reference",
    "difficulty": "All Levels",
    "author": "Wiki Team",
    "lastUpdated": "2024-03-18",
    "description": "Comprehensive guide to finding every important item in The Forge Roblox. Learn where to find quest items, rare ores, and legendary equipment.",
    "content": [
      {
        "section": "Quest Items",
        "text": "The Unknown Key is obtained by completing Bard's Lost Guitar quest. Find the guitar in a hidden hole near Umut the Brave in Stonewake Mine. The Arcane Pickaxe is located in Fallen Angel's Cave, unlocked with the Unknown Key. Tomo's Lost Cat can be found behind a waterfall wall in the Goblin Cave."
      },
      {
        "section": "Ore Locations by Depth",
        "text": "Ores in The Forge are found at specific depth ranges. Stone and Coal start at 0-10m. Copper appears at 25m+. Iron at 50m+, Silver at 100m+, Gold at 150m+, Platinum at 250m+. Rare ores like Mithril (400m+), Demonite (600m+), Titanium (800m+), Adamantite (900m+), and Luminite (1000m+) require deeper mining with powerful pickaxes."
      },
      {
        "section": "Forging Locations",
        "text": "Visit the Anvil to access the manual forging minigame. Here you can craft weapons, tools, and equipment from ore ingots. The forging location is accessible from the main spawn area and is essential for upgrading your gear throughout the game."
      },
      {
        "section": "Race Reroll Location",
        "text": "Find the Wizard NPC at Stonewake's Cross to reroll your race. This location is easily accessible from spawn and is where you'll spend codes or currency for race rerolls. Remember that Mythical races have only a 0.5% drop rate."
      },
      {
        "section": "Quest NPCs",
        "text": "The Bard is located at the spawn campfire, offering the Lost Guitar quest. Tomo can be found in the main area, requesting help finding his lost cat. The Goblin King resides in the Forgotten Kingdom, requiring escalating tributes to challenge."
      }
    ],
    "tags": ["items", "locations", "reference", "guide", "ore-locations"]
  },
  {
    "slug": "forging-guide",
    "title": "Complete Forging Guide - Master the Crafting System",
    "category": "Forging",
    "difficulty": "Intermediate",
    "author": "Master Smith",
    "lastUpdated": "2024-03-22",
    "description": "Learn everything about the manual forging minigame in The Forge. Master the 3-step process to create Normal, Masterwork, and Legendary quality items.",
    "content": [
      {
        "section": "Introduction to Forging",
        "text": "The Forge features a unique manual forging minigame where you craft weapons and tools yourself. This 3-step process requires timing and skill to achieve higher quality results. The quality levels are: Normal (baseline), Masterwork (superior stats), and Legendary (maximum power)."
      },
      {
        "section": "The 3-Step Forging Process",
        "text": "Step 1: Heat the metal to the correct temperature. Watch the temperature gauge and stop at the optimal point. Step 2: Strike the metal at the right moment to shape it. Timing is crucial here. Step 3: Quench the weapon at the perfect time to temper it. Master all three steps for Masterwork quality."
      },
      {
        "section": "Materials Needed",
        "text": "You need ore ingots to forge items. Smelt raw ores using Coal at the furnace to create ingots. Different items require different materials: Iron for basic weapons, Gold for mid-tier, Mithril for Epic gear, and Demonite/Adamantite for Legendary and Mythical equipment."
      },
      {
        "section": "Quality System",
        "text": "Normal quality items have baseline stats. Masterwork quality significantly increases damage, durability, and effectiveness. Legendary quality (very rare) provides maximum power. Practice with common materials before attempting rare ores to perfect your technique."
      },
      {
        "section": "Essential Crafted Items",
        "text": "Key items to forge include: Iron Pickaxe for early mining upgrades, Golden Sword for combat, Mithril Blade for Epic-tier power, Demonite Axe for Legendary damage, and the Colossal Sword for the ultimate end-game weapon. Each requires mastering the forging minigame."
      }
    ],
    "tags": ["forging", "crafting", "minigame", "guide", "intermediate"]
  },
  {
    "slug": "quest-walkthrough",
    "title": "Complete Quest Walkthrough - The Forge",
    "category": "Walkthrough",
    "difficulty": "All Levels",
    "author": "Wiki Team",
    "lastUpdated": "2024-03-25",
    "description": "Step-by-step walkthrough for all main and side quests in The Forge Roblox. Never get stuck on a quest again!",
    "content": [
      {
        "section": "Quest Order Recommendation",
        "text": "Recommended order: Start with Bard's Lost Guitar → Arcane Pickaxe Quest → Mining Master → Forging Apprentice → Lost Cat → Race Reroll → Goblin King (after gathering resources) → The Forge Master (end-game)."
      },
      {
        "section": "Bard's Lost Guitar Quest",
        "text": "Find the Bard NPC at the spawn campfire. Accept the quest to find his lost guitar. Travel to Stonewake Mine and locate Umut the Brave. Search for a hidden hole in a bush near this NPC. The guitar is inside. Return it to the Bard to receive the Unknown Key."
      },
      {
        "section": "Arcane Pickaxe Quest",
        "text": "With the Unknown Key from Bard's quest, locate the Fallen Angel's Cave. Use the key to unlock the cave entrance. Inside, you'll find the legendary Arcane Pickaxe, which dramatically increases mining speed and efficiency. This is essential for all future mining activities."
      },
      {
        "section": "Goblin King Quest Strategy",
        "text": "This quest requires significant resource preparation. Gather Gold, Topaz, and progressively rarer gems for the five escalating tributes. Start with Gold for tribute 1, then add Topaz for tribute 2. Continue escalating until tribute 5 requires Gold + Rubies. Only attempt this quest after accumulating all required materials."
      },
      {
        "section": "Tips for End-Game",
        "text": "For The Forge Master quest, you need to: Reach maximum mining depth (1000m+), collect all rare ores including Luminite, forge a Masterwork quality weapon, complete all main quests including Goblin King, and craft the Colossal Sword. This is the ultimate challenge requiring mastery of all game systems."
      }
    ],
    "tags": ["quests", "walkthrough", "guide", "tutorial", "step-by-step"]
  },
  {
    "slug": "arcane-pickaxe-guide",
    "title": "How to Get Arcane Pickaxe - Complete Guide",
    "category": "Quest",
    "difficulty": "Beginner",
    "author": "The Forge Wiki Team",
    "lastUpdated": "2024-12-01",
    "description": "Complete step-by-step guide to get the Arcane Pickaxe in The Forge Roblox. Learn how to complete Bard's Lost Guitar quest, find the Unknown Key, and unlock Fallen Angel's Cave to obtain this S+ tier mining tool.",
    "content": [
      {
        "section": "Why You Need the Arcane Pickaxe",
        "text": "The Arcane Pickaxe is the best mining tool in The Forge Roblox. With 100% luck chance and +200% mining speed, it dramatically improves your ability to find rare ores like Mithril, Demonite, and Luminite. This S+ tier pickaxe is essential for efficient resource gathering and progressing through the game. Without it, mining becomes extremely slow and frustrating."
      },
      {
        "section": "Step 1: Complete Bard's Lost Guitar Quest",
        "text": "First, you need to find the Bard NPC at the spawn campfire area. Accept his quest to find his lost guitar. The guitar is located in Stonewake Mine near an NPC named Umut the Brave. Look for a hidden hole in a bush near this NPC - the guitar is inside. Return it to the Bard to receive the Unknown Key, which is required for the next step."
      },
      {
        "section": "Step 2: Locate Fallen Angel's Cave",
        "text": "With the Unknown Key in your inventory, you need to find the Fallen Angel's Cave. This cave is located in a specific area of the map. Look for a locked cave entrance that requires a key to open. The exact location may vary, but it's typically in a secluded area away from the main spawn point."
      },
      {
        "section": "Step 3: Unlock the Cave and Claim Your Reward",
        "text": "Use the Unknown Key to unlock the Fallen Angel's Cave entrance. Once inside, explore the cave to find the legendary Arcane Pickaxe. It's usually located in a prominent position within the cave. Simply interact with it to add it to your inventory. Congratulations - you now have the best mining tool in the game!"
      },
      {
        "section": "Tips and Tricks",
        "text": "Complete this quest as early as possible - the Arcane Pickaxe will make all subsequent mining activities much faster. The +200% mining speed bonus means you'll gather resources 3x faster than with basic pickaxes. The 100% luck chance also significantly increases your chances of finding rare ores, making it essential for crafting high-tier equipment."
      },
      {
        "section": "What to Do After Getting the Arcane Pickaxe",
        "text": "With the Arcane Pickaxe, you can now efficiently mine rare ores at deeper depths. Focus on gathering Mithril (400m+), Demonite (600m+), Titanium (800m+), Adamantite (900m+), and Luminite (1000m+) for end-game crafting. Use these materials to forge powerful weapons and complete advanced quests like the Goblin King challenge."
      }
    ],
    "tags": ["arcane-pickaxe", "quest", "mining", "beginner", "guide", "tool"]
  },
  {
    "slug": "lost-cat-quest-guide",
    "title": "Lost Cat Quest - Complete Walkthrough",
    "category": "Quest",
    "difficulty": "Beginner",
    "author": "The Forge Wiki Team",
    "lastUpdated": "2024-12-01",
    "description": "Step-by-step guide to complete Tomo's Lost Cat quest in The Forge Roblox. Find the cat hidden behind a waterfall wall in the Goblin Cave and claim your rewards.",
    "content": [
      {
        "section": "Quest Overview",
        "text": "Tomo's Lost Cat is a beginner-friendly side quest that rewards you with coins and experience. The cat is hidden in a specific location that can be tricky to find without guidance. This quest is perfect for new players looking to earn some early-game rewards."
      },
      {
        "section": "How to Start the Quest",
        "text": "Find Tomo NPC in the main spawn area. He will tell you that his cat is missing and ask for your help finding it. Accept the quest to begin your search. The quest marker will guide you in the general direction, but the exact location requires some exploration."
      },
      {
        "section": "Finding the Lost Cat",
        "text": "The cat is hidden behind a waterfall wall in the Goblin Cave area. To find it: 1) Travel to the Goblin Cave location, 2) Look for a waterfall feature, 3) Search behind the waterfall - there's a hidden passage, 4) The cat will be inside this hidden area. Interact with it to complete the quest."
      },
      {
        "section": "Quest Rewards",
        "text": "Completing the Lost Cat quest rewards you with coins and experience points. While not as valuable as the Arcane Pickaxe quest, this is still a worthwhile early-game quest that helps you get familiar with the game's exploration mechanics."
      },
      {
        "section": "Tips for Finding the Cat",
        "text": "If you're having trouble finding the waterfall, look for water features near cave entrances. The hidden passage behind the waterfall is not immediately obvious - you may need to walk through the waterfall to discover it. Don't give up if you don't find it immediately - exploration is part of the fun!"
      }
    ],
    "tags": ["lost-cat", "quest", "tomo", "beginner", "walkthrough", "guide"]
  }
]
